In [28]:
#Ayush Sharma 2093033312
#Program to demonstrate implementation of na√Øve Bayes Theorem in python
import pandas as pd
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import train_test_split

In [ ]:
url=r'https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv'
titanicdf=pd.read_csv(url)
titanicdf.head()

In [18]:
df=titanicdf
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [19]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis=1, inplace=True)
df['Sex'] = pd.get_dummies(df['Sex'], drop_first=True)

In [23]:
df.columns[df.isna().any()]
df.Age[:10]
df.Age =df1.Age.fillna(df1.Age.mean())

In [24]:
X = df.drop(['Survived'], axis=1)
y = df['Survived']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [25]:
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.7761194029850746

In [27]:
X_test[0:10]
y_test[0:10]
model.predict(X_test[0:10])

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1], dtype=int64)